Autodesk.Revit.DB.Outline.GetDiagonalLength
Get the length of outline's diagonal. If called on empty outline, 0.
is returned
Returns:
The length of the diagonal.
Since:
2011

Autodesk.Revit.DB.Outline.ContainsOtherOutline(Autodesk.Revit.DB.Outline,System.Double)
Determine if this Outline contains another Outline to within tolerance.
Remarks:
If the tolerance is positive, the other Outline may extend the tolerance distance outside of this Outline in each coordinate.
If the tolerance is negative, the other Outline must lie at least the tolerance distance inside of this Outline in each coordinate to be a match.
otherOutline:
The outline to test for containment.
tolerance:
The tolerance to use when determining whether the point is contained. Defaults to zero.
Returns:
True if this outline contains the given outline, or false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Outline.Contains(Autodesk.Revit.DB.XYZ,System.Double)
Determine if this Outline contains the specified point to within a tolerance.
Remarks:
If the tolerance is positive, the point may lie up to the tolerance amount outside the outline in each coordinate.
If the tolerance is negative, the point must lie at least the tolerance amount inside the outline in each coordinate.
point:
The point to test for containment.
tolerance:
The tolerance to use when determining whether the point is contained. Defaults to zero.
Returns:
True if this outline contains the given point, or false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Outline.Intersects(Autodesk.Revit.DB.Outline,System.Double)
Determine if this Outline intersects the input Outline to within a specified tolerance.
Remarks:
If the tolerance is positive, the outlines may be separated by the tolerance distance in each coordinate.
If the tolerance is negative, the outlines must overlap by at least the tolerance distance in each coordinate.
outline:
The outline to test for intersection with this one.
tolerance:
The tolerance to use when determining intersection. Defaults to zero.
Returns:
True if the given outline intersects this outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Outline.AddPoint(Autodesk.Revit.DB.XYZ)
Adds a point to the bounding box, expanding it if the point is outside the existing boundary.
point:
The point to add.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Outline.IsScaleValid(System.Double)
Checks if given scale is valid. Should be greater than zero.
scale:
The scale.
Returns:
True if the scale is valid, false otherwise.
Since:
2011

Autodesk.Revit.DB.Outline.Scale(System.Double)
Scales the bounding box by given scale.
scale:
The scale value. It should be greater than zero.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The scale is invalid.
Since:
2011

Autodesk.Revit.DB.Outline.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Outline.IsEmpty
Identifies if the outline represents an empty outline.
Since:
2011

Autodesk.Revit.DB.Outline.MaximumPoint
The maximum point of the bounding box.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Outline.MinimumPoint
The minimum point of the bounding box.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Outline.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructor that uses a minimum and maximum XYZ point to initialize the outline.
minimumPoint:
The minimum point
maximumPoint:
The maximum point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Outline.#ctor(Autodesk.Revit.DB.Outline)
Constructs a new copy of the input Outline object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Outline
Outline is a generic object that provides a bounding box/bounding outline. It supports
operations to scale and transform. It also supports intersections and contains operations.
Since:
2011